{"inkVersion":20,"root":[[{"->":"tutorial"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"tutorial":[["^Tutorial: Wähle eine der Antworten aus um fortzufahren.","\n","ev","str","^Antwort 1","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Antwort 2","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Antwort 3","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Antwort 4","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Gibt es keine Antwortmöglichkeiten, klicke irgendwo auf dem Bild um fortzufahren.","\n","^Gut nun beginnt das Abenteuer.","\n",{"->":"start"},{"#f":5}]}],{"#f":1}],"start":[["^Endlich siehst du ein Ende zu diesem weiten Wald.","\n","^Es fühlt sich an als ob Tage vergangen wären seitdem du ihn betreten hast.","\n","^Aber du musst den Auftrag erfüllen um die riesige Belohnung zu kassieren.","\n","^Der Drache der sich tief im Wald versteckt, wird sich nicht von alleine töten.","\n","^Das mythische Wesen hatte in den letzten Tagen immer wieder das Vieh von Bauern gerissen.","\n","^Die Menschen hatten Angst es würde noch mehr Schäden anrichten.","\n","^Als Legende unter den Abenteurern ist es deine Aufgabe ihn zu bezwingen.","\n","^Weiter auf deinem Weg schiebst du die Äste der Bäume zur Seite und trittst in eine Lichtung.","\n","^Doch was du siehst, ist nicht das was du erwartet hast.","\n","^In der Mitte der offenen Fläche siehst du zwei Ritter Schwerter kreuzen. Einer in heller und einer in dunkler Rüstung.","\n","^Hinter dem Ritter in der hellen Rüstung siehst du eine Dame in einem leichten Kleid vor Angst kauern.","\n","ev","str","^\"<color=red>Stoppt</color> sofort den <color=red>Kampf!</color>\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^<color=green>Laufe</color> auf die beiden <color=green>zu</color> um den <color=green>Kampf</color> zu stoppen.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^<color=blue>Schaue still zu.</color>","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Unter dir knackt ein Stock.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Der helle Ritter hört dich, <color=blue>erschrickt</color> und wendet sich dir zu.","\n","^Diese Gelegenheit nutzt der schwarze Ritter.","\n","^Er schlägt das Schwert seines Gegners davon und bohrt sein eigenes zwischen die Rüstungen des hellen Ritters.","\n","^So ist der Kampf vorbei. Der dunkle Ritter befreit sein Schwert, der Helle fällt zu Boden und bleibt reglos liegen.","\n","^Der dunkle Ritter wendet sich jedoch direkt seinem nächsten Ziel zu, der <color=blue>verängstigten Dame</color>.","\n","^Sie richtet sich an dich. \"<color=red>Hilf mir</color>, bitte<color=red>!</color>\", ruft sie dir mit <color=blue>Tränen in den Augen</color> zu.","\n","^Du stellst dich zwischen den dunklen Ritter und die Frau.","\n","^\"<color=yellow>Vertrau</color> ihr <color=yellow>nicht</color>, sie ist <color=yellow>nicht</color> so <color=yellow>unschuldig</color> wie du denkst.\" Spricht eine <color=red>tiefe</color> Stimme, die durch den dunklen Helm gedämpft wird.","\n","^\"Sie ist eine <color=red>mächtige</color> Hexe die dich nur <color=red>ausnutzen</color> wird um an den Schatz des Drachen zu kommen.\"","\n","^\"Du <color=red>wirst</color> so <color=red>enden</color> wie ihr erster Begleiter. Ich <color=green>helfe dir</color> den Drachen zu legen, aber <color=red>mische dich nicht ein!</color>\"","\n","^Langsam geht der dunkle Ritter auf dich und die Frau zu.","\n","^Die Frau ruft: \"Bitte <color=blue>lass nicht zu</color>, dass er <color=red>mich tötet</color>. Auch ich <color=green>kann</color> dir bei der Suche nach dem Drachen <color=green>helfen</color>.\"","\n","ev","str","^<color=red>Ziehe</color> dein <color=red>Schwert.</color>","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^<color=yellow>Tritt zur Seite</color>.","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n",{"->":"fightKnight"},{"#f":5}],"c-4":["\n",{"->":"ladyDeath"},{"#f":5}],"#f":5}]}],{"#f":1}],"fightKnight":["^Dein Schwert schnellt aus der Scheide und du läufst auf den dunklen Ritter zu.","\n","^Er blockt deinen ersten Angriff, doch du merkst, er ist kein erfahrener Schwertkämpfer. Anders als du.","\n","^Du wartest auf den Rückschlag deines Gegners.","\n","^Mit einem geschickten Manöver schlägst du das Schwert des Gegners zur Seite.","\n","^Dein Schwert schnellt erneut nach vorne und diesmal triffst du den Helm des dunklen Ritters.","\n","^Der Helm fliegt davon und mit einem lauten metallischen Klang fällt der Rest der Rüstung zu Boden.","\n","^“<color=green>Danke</color> für deine <color=green>Hilfe</color>. Ich <color=purple>halte mein Versprechen</color> ein und bringe dich zum Drachen, folge mir.”, sagt die Frau.","\n","^Auf dem Weg beginnt sie weiter zu erzählen:","\n","^“Der Ritter hatte Recht, ich bin eine Hexe, auch ich möchte den <color=red>Drachen bezwingen.</color>”","\n","^“Ich habe einen Vorschlag für dich, ich <color=green>helfe dir</color> im Kampf, du darfst dir die <color=purple>Belohnung</color> für den Drachen <color=purple>behalten</color>.\"","\n","^\"Dafür <color=yellow>nehme</color> ich den <color=yellow>Schatz</color> des Drachen.”","\n",{"->":"Schatzverhandlung"},{"#f":1}],"ladyDeath":["^Der dunkle Ritter geht auf die Frau zu und hebt sein Schwert, bereit zum Schlag.","\n","^Plötzlich schreit die Frau vor Wut, aus ihrer Hand schießt ein magisches Projektil und trifft den dunklen Ritter in die Brust.","\n","^Eine kleine Explosion entsteht beim Auftreffen und eine Rauchwolke verdeckt die Sicht auf den Ritter.","\n","^Langsam legt sich die Rauckwolke, der dunkle Ritter steht noch immer auf den Beinen.","\n","^An der Stelle, an welcher die Rüstung von dem Projektil getroffen wurde, ist kein Kratzer zu sehen.","\n","^\"Unmöglich\", schreit die Frau. Ihre Hand beginnt wieder zu leuchten, bereit das nächste Geschoss abzufeuern.","\n","^Doch das Schwert des dunklen Ritters ist schneller. Ein kurzer Schrei und die Magie in der Hand der Frau erlischt.","\n","^“Ich <color=purple>halte mein Versprechen</color> ein. Folge mir und ich helfe dir den <color=red>Drachen</color> zu <color=red>bezwingen</color>”, sagt der dunkle Ritter.","\n","^Auf dem Weg beginnt er weiter zu erzählen:","\n","^“Ich bin im Namen meines <color=purple>Meisters</color>, eines Magiers, gekommen um mit dem <color=red>Drachen</color> zu <color=red>kämpfen</color>.”","\n","^“Ich habe einen Vorschlag für dich, ich <color=green>helfe dir</color> im Kampf, du darfst dir die <color=purple>Belohnung</color> für den Drachen <color=purple>behalten</color>.\"","\n","^\"Dafür <color=yellow>nehme</color> ich den <color=yellow>Schatz</color> des Drachen.”","\n",{"->":"Schatzverhandlung"},{"#f":1}],"Schatzverhandlung":[["ev","str","^\"<color=red>Auf keinen Fall</color>, der Schatz ist sicher mehr Wert, du willst mich nur <color=red>abziehen</color>.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Ich würde lieber den Schatz und die Belohnung <color=purple>teilen</color>.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^<color=green>Stimme</color> dem Angebot <color=green>zu</color>.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^\"Was ist der <color=yellow>Schatz?</color>\"","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Deine Begleitung antwortet:","\n","^\"Das Gold des Drachen kannst du behalten, es gibt noch etwas anderes in dem Schatz, das ich haben möchte.\"","\n","^\"Ich zeige es dir, sobald wir den <color=red>Drachen besiegt</color> haben.\"","\n",{"->":"dragon_encounter_start"},{"#f":5}]}],{"#f":1}],"dragon_encounter_start":[["^Gemeinsam mit deiner Begleitung kommst du nach einer Weile Fußweg zu einer Höhle.","\n","^Du trittst in den dunklen Höhleneingang vor dir und dringst immer tiefer und tiefer vor. Es wird zunehmend dunkler.","\n","^Langsam gewöhnen sich deine Augen daran.","\n","^In der Dunkelheit kannst du erkennen, dass der Höhlenweg in einer offenen Stelle mündet.","\n","^Die Decke der Höhle sieht etwas instabil aus und durch ein paar Löcher fallen Lichtstrahlen ein.","\n","^Du erkennst einen großen schwarzen Fleck in der Mitte liegen. Der Drache! Mit einem Grollen bewegt sich die gigantische Kreatur.","\n","^Auf den ersten Blick siehst du nur orange Augen in der Dunkelheit.","\n","^Langsam tritt die Kreatur nach vorne und wird von den Sonnenstrahlen beleuchtet die durch die Decke fallen.","\n","^Du schaust auf und vor dir steht ein gewaltiger roter Drache. Er senkt seinen Kopf zu dir und deiner Begleitung.","\n","^“Ihr <color=blue>Menschen</color> seid <color=blue>alle gleich</color>, ihr seid gekommen um den <color=yellow>Schatz zu nehmen</color>.\"","\n","^\"<color=yellow>Nehmt</color> so viel <color=yellow>Gold</color> ihr wollt und lasst mich in <color=green>Frieden</color>!” ertönt eine <color=red>mächtige</color>, <color=blue>ruhige</color> Stimme.","\n","^Du bist verwundert, der Drache kann sprechen! Dennoch, vertraust du ihm und brichst deine Pflicht?","\n","^Der Drache weicht zur Seite und neben ihm ist ein riesiger Goldhaufen zu erkennen.","\n","ev","str","^\"Wir sind gekommen um dich zu <color=red>töten</color>, du <color=red>wilde Bestie!</color>\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Mit so <color=yellow>viel Gold</color> kann ich in den Ruhestand! Ich werde <color=yellow>mich bedienen</color>.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"Woher wissen wir, dass wir dir <color=purple>vertrauen</color> können<color=purple>?</color>\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Der Drache antwortet:","\n","^\"Ich <color=blue>werde</color> aus diesem Gebiet <color=blue>fliehen</color>, sobald mein Kind geschlüpft ist.\"","\n","^\"Die Schäden die ich angerichtet habe waren notwendig. Ich brauchte Nahrung.\"","\n","^\"Diese Begegnung muss nicht in einem <color=red>blutigen Kampf</color> enden.\"","\n","^\"Wir können <color=green>friedlich</color> voneinander gehen und ihr könnt davon <color=yellow>profitieren</color>.\"","\n","ev",{"CNT?":"fightKnight"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Wen interessiert das Gold. Ich wusste, dass du ein <color=yellow>Ei</color> versteckst und es wird <color=yellow>mir gehören</color>.\", schreit die Frau.","\n","^Die Hand der Frau leuchtet und ein magisches Projektil schnellt gegen die Decke. Der Drache erschickt, und schlägt mit seinem Schweif zu.","\n","^Du kannst rechtzeitig nach hinten ausweichen.","\n","^Die Frau wird durch die Wucht gegen eine Wand geschleudert, fällt auf den Boden und bleibt regungslos liegen.","\n",{"->":".^.^.^.14"},null]}],"nop","\n","ev",{"CNT?":"ladyDeath"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Das Gold interessiert mich nicht, mein Meister wusste, dass du ein <color=yellow>Ei versteckst</color>.\", ruft der Ritter.","\n","^\"Es wird <color=yellow>mir gehören</color>.\"","\n","^Der dunkle Ritter schnellt vor und springt auf den Kopf des Drachen.","\n","^Panisch versucht der Drache ihn abzuschütteln und schwenkt den Kopf wild durch die Höhle.","\n","^Mit einer ruckartigen Bewegung zieht der Drache den Kopf nach oben und kracht gegen die Decke.","\n","^Der Ritter wird durch die Wucht weggeschleudert, kommt am Boden auf und bleibt regungslos liegen","\n",{"->":".^.^.^.20"},null]}],"nop","\n","^Ein lautes Krachen ist zu hören und die instabile Decke über dem Drachen bricht ein.","\n","^Große Felsen und Erdteile fallen auf ihn herab und begraben ihn. Vereinzelt sind Teile des Körpers und Kopfes zu sehen.","\n","^Verzweifelt windet sich der Drache, um sich aus seinem erdigen Grab zu befreien.","\n","^Doch er kann die Masse an Erde und Felsen nicht heben. Schutzlos liegt die Bestie da, deine Chance ihn zu erlegen.","\n","^“Mensch, du kannst mich töten, aber bitte <color=purple>verschone mein Ei</color>, bringe es an einen sicheren Ort, ich bitte dich!\"","\n","ev","str","^\"Ich verspreche nichts Bestie. <color=red>Stirb!</color>\"","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^\"<color=blue>Es tur mir Leid</color>. Ich muss meine Pflicht erfüllen.\"","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^<color=green>Hilf dem Drachen</color> und versuche ihn von den Felsen zu befreien.","/str","/ev",{"*":".^.c-5","flg":20},{"c-3":["\n","^Du rammst dein Schwert in den Hals des Drachen der unter den Felsen hervorschaut.","\n","^Du siehst wie das Atmen des Drachen langsamer wird und schließlich aufhört. Deine Pflicht is erfüllt.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-4":["\n","^Du rammst dein Schwert in den Hals des Drachen der unter den Felsen hervorschaut.","\n","^Du siehst wie das Atmen des Drachen langsamer wird und schließlich aufhört. Deine Aufgabe is erfüllt.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-5":["\n","^Du kletterst auf den Felshaufen welcher den Drachen bedeckt und versuchst einen der Steine zu bewegen.","\n","^Keine Chance. Die Ansammlung an Erdteilen und Felsen sind zu schwer für dich.","\n","^\"Es ist in Ordnung Mensch, bitte <color=green>kümmere dich</color> um mein <color=green>Ei</color>.\", spricht der Drache ruhig.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Du gehst hinter den Drachen und siehst in einem Nest aus Heu ein großes geflecktes Ei liegen.","\n","^Was wirst du tun. Zerstörst du das Ei um die Drachen zu vernichten?","\n","^Oder nimmst du es auf, aber wie könntest du einen Drachen großziehen?","\n","^Am Schwarzmarkt würde es dafür sicher einen guten Preis geben, wenn deiner Begleitung das Ei wichtiger als Gold war.","\n","ev","str","^<color=red>Zerschlage</color> das <color=red>Ei</color> mit deinem Schwert.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Nimm das <color=green>Ei</color> mit. Du wirst dich darum <color=green>kümmern</color>.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^<color=yellow>Lüge</color> den Drachen an. Das <color=yellow>Ei</color> nehmen um es zu <color=yellow>verkaufen</color>.","/str","/ev",{"*":".^.c-8","flg":20},{"c-6":["\n","^Deine Pflicht ist erfüllt, du verlässt die Höhle. Du hast den <color=red>Drachen erlegt</color> und auch die zukünftige <color=red>Bedrohung eliminiert</color>.","\n","^Für deine Taten wirst du <color=purple>Ruhm und Ehre</color> im Königreich genießen.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-7":["\n","^Du sprichst: \"Keine Sorge, ich werde dein <color=green>Kind</color> an mich nehmen und es <color=green>beschützen</color>, darauf <color=purple>schwöre</color> ich bei meiner <color=purple>Ehre</color>.\"","\n","^Dein Leben wird sich nun um einiges ändern, wie es wohl sein wird einen Drachen bei sich zu haben.","\n","^Mit dem Ei in der Hand verlässt du Höhle.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-8":["\n","^Du <color=yellow>heuchelst</color>: \"Oh mach dir garkeine Sorge, ich weiß ganz genau wie ich mit dem Ei umgehen sollte.\"","\n","^In kurzer Zeit wirst du <color=yellow>reich</color> sein. Du kannst dich aus dem Abenteurer Leben zurückziehen und endlich ein <color=blue>ruhiges Leben</color> genießen.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Was für ein unerwartetes Abenteuer. Auf deinem Rückweg fragst du dich nur eins. Was wäre passiert, hätte ich anders gehandelt?","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev",false,{"VAR=":"darkKnightAlive"},"/ev","end",null],"#f":1}],"listDefs":{}}